// import { useEffect, useState } from "react";
// import { shopBackground, shopItem1Pink, shopItem1Blue } from "@/assets";
// import { Link } from "react-router-dom";
// import ProSwimmerCard from "@/components/Albums/ProSwimmerCard";
import HeroTextBg from "@/components/shared/HeroTextBg";

import ".././CSS/RulesNProcedures.css";

export default function RulesNProcedures() {
  return <div className="RulesNProceduresPage pt-[84px] pb-20 text-[18px]">
    <HeroTextBg title="القواعد والإجراءات" TextClassName="rtl"></HeroTextBg>
    {/* start of heroSection */}
    <div className="content px-[3rem] py-[3rem] flex flex-col gap-10">
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">القواعد والإجراءات</h3>
        {/* --- */}
        <div className="textBox flex flex-col gap-4 ">
          <p>
            تسعى مدرسة بروسويم-المتخصصة بتعليم السباحة-وتبذل أقصى جهودها للوصول إلى التميز والامتياز في تقديم خدماتها ،لتحقيق أعلى مستويات النجاح ،وللتطوير المستمر في كل وسائل التعليم لديها ،غير انه من ناحية أخرى ،تتميز بمجموعة من القواعد والقوانين الخاصة بها.
          </p>
        </div>
        {/* --- */}
      </div>
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">
          هدف هذه السياسة القواعد والإجراءات:
        </h3>
        <div className="textBox flex flex-col gap-4 ">
          <p>
            إدراكاً منها لمدى أهمية التطور الجسدي والعقلي لكل تلميذ ..وايماناً منها بمقولة العقل السليم في الجسم السليم ..وانطلاقاً من ضرورة تعلم السباحة كمهارة للحياة والنجاة ،تهدف سياستنا إلى:
            <br />
          </p>
          <ul className="pr-4 text-right">
            <li>
              ١.الامتثال لكل ما تفتضيه دروس مهارات السلامة من متطلبات.
            </li>
            <li>
              ٢.التأكد من الحفاظ على سلامة وحماية وكرامة كل طفل.
            </li>
            <li>
              ٣.توفير الوضوح والدقة في كل ما يتعلق بالقواعد والإجراءات والمسؤوليات.
            </li>
          </ul>
          <p>
            تحتفظ مدرسة بروسويم بكامل الحقوق التي تخولها تغيير أو تعديل أو إلغاء أي أو جميع هذه القواعد والإجراءات المبينة في هذه السياسة بأي وقت.
            <br />
            أي تغيير أو تعديل أو إلغاء سيتم نشره خطياً وعلى الموقع الإلكتروني للأكاديمية www.proswim-lb.com ويكون نافذاً وفعالاً لحظة إعلانه.
          </p>
        </div>
        {/* --- */}
      </div>
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">
          يشكل تسجيلك المستمر بالمدرسة:
        </h3>
        <div className="textBox flex flex-col gap-4 ">
          <ul className="list-disc pr-6 text-right">
            <li>
              موافقة ضمنية لأي تغيير أو تعديل أو إلغاء يطرأ
            </li>
            <li>
              اعتراف وعلم وفهم أنه من مسؤوليتك مراجعة الموقع الإلكتروني للمدرسة بشكل دوري ودائم، خاصة قسم القواعد والإجراءات، للاطلاع على اي تغيير أو تعديل أو إلغاء.
            </li>
          </ul>

        </div>
        {/* --- */}
      </div>
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">
          سياسة تعويض الحصص الفائتة:(التي تعذر حضورها)
        </h3>
        <div className="textBox flex flex-col gap-4 ">
          <ul className="list-disc pr-6 text-right flex flex-col gap-4">
            <li>
              لكل السباحين المسجلين ضمن نظام التمرين الخاص، يسعدنا تقديم حصتين لكل رزمة حصص(مجموعة حصص) عوضاً عن الحصص الفائتة.            </li>
            <li>
              يجب ان تتلقى المدرسة إشعاراً بالغياب خلال ٢٤ ساعة من موعد بدء الحصة المحددة حتى يتم تعويضها.
            </li>
            <li>
              لكل السباحين المسجلين ضمن نظام التمرين الجماعي (المجموعة) تقدم الحصص البديلة للحصص الفائتة التي تعذر حضورها عند الإمكانية.
            </li>
            <li>
              لا تحل الحصص البديلة محل الحصة الأساسية ولا تؤدي إلى نقص في رسوم ومستحقات الفصل اللاحق للحصص.
            </li>
            <li>
              يجب ان يستفاد من الحصص البديلة خلال الفصل ذاته وإلا يتم خسارتها؛ إذ تعتبر منتهية الصلاحية ولا يمكن حملها للفصل اللاحق الجديد ولا يمكن المطالبة بها.
            </li>
            <li>
              من مصلحة طفلك أن يقتصر الغياب على حالات المرض الحقيقية والتي تستوجب الغياب.
            </li>
            <li>
              عدم حضور الحصة البديلة يفقدها صلاحيتها ولا يمكن المطالبة بها مجدداً.
            </li>
            <li>
              عدم إشعار المدرسة بالغياب مترافقاً مع عدم الحضور لا يخولك المطالبة بحصة بديلة.
            </li>
          </ul>

        </div>
        {/* --- */}
      </div>
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">
          إلغاء/سحب الاشتراك (التسجيل):
        </h3>
        <div className="textBox flex flex-col gap-4 ">
          <p>
            إذا أردت بأي وقت أن تلغي تسجيلك بالأكاديمية ،أو أن تسحب اشتراكك في حضور الحصص ،عليك أن تقوم بإشعار وتبليغ المدرسة بقرارك هذا، في مهلة لا تقل عن الأسبوعين قبل تاريخ إلغائك الفعلي، وذلك إما بالاتصال مباشرةً بالمدرسة أو عن طريق إرسال رسالة نصية.
            <br /><br />
            بحال لم تتلق المدرسة مثل هذا الإشعار، يعتبر مكان التلميذ قائماً ومحجوزاً ومحفوظاً، والرسوم المتوجبة عليه مستحقة الدفع.
          </p>

        </div>
        {/* --- */}
      </div>
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">
          إعادة المال/تجميد الإشتراك/إغلاق الحساب:
        </h3>
        <div className="textBox flex flex-col gap-4 ">
          <ul className="list-disc pr-6 text-right flex flex-col gap-4">
            <li>
              لا تقدم الأكاديمية إمكانية استرداد المال المدفوع مسبقاً كبدل عن الإشتراك في دروس السباحة، لأي سباح مشترك وقد بدأ فصله بالفعل.
            </li>
            <li>
              بحال عدم تمكنك من حضور الحصص في أوقاتها المسجلة الحالية، فإن مشرفينا جاهزون لمساعدتك في العثور على مكان شاغر في الحصص اتي تناسب وقتك.
            </li>
            <li>
              بحال المرض أو الإصابة التي تستدعي الغياب الطويل(اكثر من شهر) يمكننا تجميد حسابك أو توقيفه مؤقتاً حتى تتمكن من استئناف الحضور.
            </li>
            <li>
              لا يمكن استرداد أي مبلغ من المال بأي حالة أخرى.
            </li>
            <li>
              في حالات الطوارئ العامة والمشتركة، أو العواصف الجوية الخطرة (الفيضانات ، والأعاصير ، ....) ، أو الحروب ، أو تفشي الأمراض الوبائية ، أو أي حالة أخرى من الأحداث غير المتوقعة .. والتي تؤدي إلى إغلاق أكاديميتنا ، لا إمكانية لاسترداد أي أموال تم دفعها مسبقًا كبدل للاشتراك في دروس السباحة في الأكاديمية ،بل سيتم تعليق (تجميد) حسابك حتى تتمكن من استئناف الدروس.
            </li>
            <li>
              يتم تقديم الحصص البديلة كعوض عن الحصص الفائتة التي تعذر حضورها (تخضع لشروط وأحكام الحصص البديلة).
            </li>
            <li>
              إذا كنت مسجلاً في فصل لم يبدأ بعد، فسوف يسعدنا إعادة ما دفعته.
            </li>
            <li>
              يجب ملء ورقة استرداد المال المتواجدة عند مكتب المشرف وذلك قبل انتهاء الفصل الحالي.
            </li>
            <li>
              إن المبالغ المستردة ليس لها أي أثر رجعي؛ ولذلك فإن أي طلب لاسترداد المال يجب أن يتم خلال الفصل الحالي.
            </li>
            <li>
              في حال وجود حصة فائتة تعذر حضورها أو حصة تم إلغاؤها لا وجود لإمكانية استرداد أي مال عوضاً عنها.
            </li>
          </ul>
        </div>
        {/* --- */}
      </div>
      {/* ==== */}
      <div>
        <h3 className="font-[Playfair-Display] mb-[14px] text-[25px] font-[700] underline">
          دروس مستمرة:
        </h3>
        <div className="textBox flex flex-col gap-4 ">
          <p>
            إن فصل دروس السباحة الخاص بنا هو عبارة عن حصص مدتها ٤ أشهر..
          </p>
          <p>
            لا يتوجب عليك تجديد الاشتراك/الحجز كل شهر؛ إذ أن حجزك يعتبر دائماً حتى تقوم بإبلاغنا بقرار الإلغاء أو سحب الاشتراك.
          </p>

        </div>
        {/* --- */}
      </div>
      {/* ==== */}

    </div>
  </div >
}